================
Simple program
================

.main
DUP
.end-main

---
(source_file
    (main_program
        (command)))

==================================
Program with command with argument
==================================

.main
ILOAD 0x01
.end-main

---
(source_file
    (main_program
        (command)
        (hex_number)))

===========================================
Program with command with label as argument
===========================================

.main
ILOAD mylabel
.end-main

---
(source_file
    (main_program
        (command)
        (identifier)))

====================
Program with numbers
====================

.main
0x01 032
.end-main

---
(source_file
    (main_program
        (hex_number)
        (oct_number)))

==================
Program with label
==================

.main
label: DUP
.end-main

---
(source_file
    (main_program
        (label (identifier))
        (command)))

==============================
Program with label on new line
==============================

.main
label:
    DUP
other:
    ILOAD total
.end-main

---
(source_file
    (main_program
        (label (identifier))
        (command)
        (label (identifier))
        (command)
        (identifier)))